Revit 2027 API
WireConduitType Class
 Represents a specific conduit type of wire type.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.WireConduitType
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WireConduitType : APIObject
Public Class WireConduitType
	Inherits APIObject
public ref class WireConduitType : public APIObject
type WireConduitType =
    class
        inherit APIObject
    end
The WireConduitType type exposes the following members.
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Name
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace